{"html":"<p>As I spend another night alone, I yet again come to the conclusion that living is simply pointless for someone like me.</p><p>I simply can&apos;t compare to normal people. I didn&apos;t grow up the same way as they did. I didn&apos;t experience the same things they got to experience. My entire foundation is so fundamentally different that I simply can never compare or compete with even a below average person.</p><p>How can I be social when I&apos;ve never had a social life?</p><p>How can I gain social experience when the period for social learning and awkwardness has passed?</p><p>How can I gain the meaningful experiences of youth, when my youth is already passing me by?</p><p>The answer is simple: I can&apos;t.</p><p>I&apos;ve not had a meaningful reason to wake up for over half my life now. I have no reason, will, or drive to continue with living. Unfortunately as much as I hate living I still fail over and over again to successfully die.</p><p>So here I sit, suffering the fate of the observer - one who does not interact with life; one who does not get to experience the ups and downs; one who mearly lives through observing the other.</p><p>I don&apos;t know what love is.</p><p>I&apos;ll never know what young love was like.</p><p>I barely know what it&apos;s like to hang out with friends socially.</p><p>I don&apos;t know what it&apos;s like to go to a party; clubs, and pubs.</p><p>I don&apos;t know what it was like to grow up with everyone else, observing the changes in myself and one another.</p><p>I don&apos;t have any social validation.</p><p>I don&apos;t have any sexual validation.</p><p>I don&apos;t have any academic validation.</p><p>I don&apos;t have a career.</p><p>I don&apos;t know what it&apos;s like to do anything without my mum or other family member always leering at me and being involved.</p><p>To careless banter with friends.</p><p>To do anything...</p><p>I don&apos;t even know what a normal, healthy school life would be, since I&apos;ve been off the rails for so long.</p><p>I don&apos;t know what it is like to be human.</p><p>And the harsh truth is simply, I&apos;ll always be behind now. I&apos;ll always be a failure. I&apos;ll forever be lesser and insignificant.</p><p>Why would anyone choose me over literally any other person, I&apos;m basically a baby they&apos;d have to care and cater for.</p><p>So I sit here, living my life through other people, dreaming of things I can never do or have, and simply die on the inside as I try to convince myself it&apos;s not that bad.</p><p>So I sit here, programming yet another useless project that&apos;ll amount to nothing.</p><p>So I sit here, dreaming what it&apos;d be like to be normal.</p><p>So I sit here, and see others around me grow and experience normal human experiences, while I simply get left behind further and further.</p><p>What would be a normal day out for some, is a revolution for me.</p><p>What would be a just another relationship for some, would be a miracle for me.</p><p>What would be just another hookup, would be a milestone for me.</p><p>What would be just any basic, human thing, would be a great undertaking for me.</p><p>How do I cope in such a world? I don&apos;t.</p><p>This life is wasted, and there&apos;s no fix for it, with a pain and lonliness few know, understand, or even are capable of comprehending.</p><p>By the time I finish my studies for the CCNA, it&apos;ll have changed to something completely different.</p><p>By the time I gain any confidence and social skills, I&apos;ll probably be in my 40s.</p><p>By the time I have my first sexual encounter, people half my age would have infinitely more experience than me already.</p><p>By the time I do anything, other people have already done it several times over.</p><p>But don&apos;t worry, mummy will always be there for Bad Brad, she&apos;ll always be there, watching over me, doing everything with me, for me.</p><p>Then I get to spend the rest of her life paying for her ability to live and caring for her, because poverty amirite?</p><p>This life is over, regardless whether I&apos;m alive or not. It&apos;s all over.</p>","metadata":["-","a-life-wasted","-","01-01-0001","A life wasted - The ramblings of a madman","01-01-0001"],"headers":[]}